In [1]:
import pandas as pd
import numpy as np 
import plotly.express as px

In [2]:
train = pd.read_csv("D:train.csv") 
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
train['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [6]:
train['Cabin'].describe()

count         204
unique        147
top       B96 B98
freq            4
Name: Cabin, dtype: object

In [7]:
df = train.copy()

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.shape

(891, 12)

In [10]:
df['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [11]:
df['Age'].fillna(df['Age'].mean() , inplace=True)

In [12]:
df['Age'].isna().sum()

0

In [13]:
df['Sex'] = df['Sex'].map({'male':'0' ,'female' : '1' })

In [14]:
name = []
last_name = []
for i in df['Name']:
    name.append(i.split(',')[-1].strip())
    last_name.append(i.split(',')[0].strip())
    
df['first name'] = name
df['Last name'] = last_name

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first name,Last name
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen

In [16]:
df['Third&Men'] = df.apply(lambda row: int(row['Pclass'] == 3 and row['Sex'] == 0) , axis= 1)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first name,Last name,Third&Men
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr. Owen Harris,Braund,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C,Mrs. John Bradley (Florence Briggs Thayer),Cumings,0
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss. Laina,Heikkinen,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S,Mrs. Jacques Heath (Lily May Peel),Futrelle,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S,Mr. William Henry,Allen,0

In [17]:
def find(age):
    if age <18:
        return 1
    elif age >= 18 and age <60:
        return 2
    elif age>=40 and age<60:
        return 3
    else:
        return 4

In [18]:
df['Age_group'] = df['Age'].apply(lambda x : find(x))
df['Age_group'].head()

0    2
1    2
2    2
3    2
4    2
Name: Age_group, dtype: int64

In [19]:
df = df.drop(['PassengerId','Name','Cabin','Ticket'], axis=1)

In [20]:
print(df['Embarked'].unique())
df['Embarked'].nunique()

['S' 'C' 'Q' nan]

3

In [21]:
df['Embarked'].isna().sum()

2

In [22]:
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [23]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [24]:
df['Embarked'] = df['Embarked'].map({'S':'1' ,'C' : '2' , 'Q' : '3' })
df['Embarked'].fillna(df['Embarked'].mode()[0] , inplace=True)

In [25]:
df_Third_class = df[df['Pclass'] == 3]

In [26]:
df['Gender'] = df['Sex']

In [27]:
df_female_age = df[(df['Age'] > 60) & (df['Gender'] == '1')]
df_female_age.head(2)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,first name,Last name,Third&Men,Age_group,Gender
275,1,1,1,63.0,1,0,77.9583,1,Miss. Kornelia Theodosia,Andrews,0,4,1
483,1,3,1,63.0,0,0,9.5875,1,Mrs. (Hedwig),Turkula,0,4,1

In [28]:
df_obj = df.select_dtypes(include=['object'])
df_obj.head()

  Sex Embarked                                  first name  Last name Gender
0   0        1                             Mr. Owen Harris     Braund      0
1   1        2  Mrs. John Bradley (Florence Briggs Thayer)    Cumings      1
2   1        1                                 Miss. Laina  Heikkinen      1
3   1        1          Mrs. Jacques Heath (Lily May Peel)   Futrelle      1
4   0        1                           Mr. William Henry      Allen      0

In [29]:
del df['Sex']

In [30]:
groups = df.groupby(['Pclass'])
groups.get_group(3).head(2)

,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked,first name,Last name,Third&Men,Age_group,Gender
0,0,3,22.0,1,0,7.250,1,Mr. Owen Harris,Braund,0,2,0
2,1,3,26.0,0,0,7.925,1,Miss. Laina,Heikkinen,0,2,1